; domain
(define (domain robot_waiter)

    (:requirements :strips :typing :disjunctive-preconditions :negative-preconditions)

    (:types
    plate - object
    area - position
    costumer - object
    )

    (:predicates
    (adjacent ?a1 - area ?a2 - area)       ;Wether area a1 and a2 are adjacent and not seperated
    (has_food ?p - plate)              ;Wether plate p contains food 
    (served ?c - costumer)             ;Wether costumer c has been served
    (holding ?p - plate)            ;Wether Lucki is holding plate p
    (hands_full)                        ;Whether Lucki is holding any plate
    (buffet_location ?a - area)            ;Wether the buffet is in area a
    (robot_at ?a - area)                  ;Wether the robot is in area a
    (plate_at ?p - plate ?a - area)     ;Wether the plate p is in area a
    (customer_at ?c - costumer ?a - area)  ;Wether the costumer c is in area a
    )


    ; ------ ACTIONS ------
    (:action move ;This action moves the robot from a1 to a2 
    :parameters (?a1 - area ?a2 - area)
    :precondition (and
        (robot_at ?a1)
        (or (adjacent ?a1 ?a2) (adjacent ?a2 ?a1))
    )
    :effect (and
        (not (robot_at ?a1))
        (robot_at ?a2)
    )
    )

    (:action pick_up ;This action lets the robot pick up the plate p in the area a 
        :parameters (?p - plate ?a - area)
        :precondition (and
            (robot_at ?a)
            (plate_at ?p ?a)
            (not (hands_full))
        )
        :effect (and
            (holding ?p)
            (hands_full)
            (not (plate_at ?p ?a))
        )
    )

    (:action present ;This action lets the robot present the plate p to the costumer c in area a
        :parameters (?p - plate ?c - costumer ?a - area)
        :precondition (and
            (holding ?p)
            (has_food ?p)
            (robot_at ?a)
            (customer_at ?c ?a)
            (not (served ?c))
        )
        :effect (and
            (served ?c)
            (not (holding ?p))
            (not (hands_full))
        )
    )

    (:action fill ;This action lets the robot fill the plate p in the area a
        :parameters (?p - plate ?a - area)
        :precondition (and
            (holding ?p)
            (not (has_food ?p))
            (robot_at ?a)
            (buffet_location ?a)
        )
        :effect (and
            (has_food ?p)
        )
    )
)

; problem
(define (problem basic_problem)
    (:domain robot_waiter)
    (:objects
    c - costumer
    p - plate
    bta aua pua pma ama pla ala - area
    )

    (:init
    (adjacent bta aua) (adjacent aua bta)
    (adjacent aua pua) (adjacent pua aua)
    (adjacent aua ama) (adjacent ama aua)
    (adjacent ama ala) (adjacent ala ama)
    (adjacent pua pma) (adjacent pma pua)
    (adjacent pma pla) (adjacent pla pma)
    (adjacent pla ala) (adjacent ala pla)
    (buffet_location bta)
    (customer_at c pma)
    (robot_at bta)
    (plate_at p bta)
    )

    (:goal
        (and
            (served c)
            (robot_at bta)
        )
    )
)

; plan
1. (pick_up p bta)
   deleted: (plate_at p bta)
   added: (holding p) (hands_full)
   goals met: 1 of 2
2. (fill p bta)
   added: (has_food p)
   goals met: 1 of 2
3. (move bta aua)
   deleted: (robot_at bta)
   added: (robot_at aua)
   goals met: 0 of 2
4. (move aua pua)
   deleted: (robot_at aua)
   added: (robot_at pua)
   goals met: 0 of 2
5. (move pua pma)
   deleted: (robot_at pua)
   added: (robot_at pma)
   goals met: 0 of 2
6. (present p c pma)
   deleted: (holding p) (hands_full)
   added: (served c)
   goals met: 1 of 2
7. (move pma pua)
   deleted: (robot_at pma)
   added: (robot_at pua)
   goals met: 1 of 2
8. (move pua aua)
   deleted: (robot_at pua)
   added: (robot_at aua)
   goals met: 1 of 2
9. (move aua bta)
   deleted: (robot_at aua)
   added: (robot_at bta)
   goals met: 2 of 2
